README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>readme.org</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="<2014-02-26 Wed>"/>
<meta name="author" content="N-CRITSER "/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">readme.org</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 get Clozure !!! god damn it </a>
<ul>
<li><a href="#sec-1.1">1.1 PUt it HERE </a></li>
<li><a href="#sec-1.2">1.2 download </a></li>
<li><a href="#sec-1.3">1.3 svn source </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Getting emacs to give you options </a></li>
<li><a href="#sec-3">3 Getting the options working in emacs </a>
<ul>
<li><a href="#sec-3.1">3.1 M- - M-x slime (thats Alt minus sign then Alt-x slime) </a></li>
<li><a href="#sec-3.2">3.2 ccl     ;; for 32 bit </a></li>
<li><a href="#sec-3.3">3.3 ccl64   ;; for 64 bit </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> get Clozure !!! god damn it </h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> PUt it HERE </h3>
<div class="outline-text-3" id="text-1.1">




<pre class="example">cd /usr/local/src/ 
</pre>



</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> download </h3>
<div class="outline-text-3" id="text-1.2">

<p><a href="http://ccl.clozure.com/downloads.html">http://ccl.clozure.com/downloads.html</a>
</p></div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> svn source </h3>
<div class="outline-text-3" id="text-1.3">




<pre class="example">svn co http://svn.clozure.com/publicsvn/openmcl/release/1.9/linuxx86/ccl
//copy the run ccl script from the source location to your scripts dir
cp /usr/local/src/ccl/scripts/ccl to ~/scripts/ccl   
</pre>





</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Getting emacs to give you options </h2>
<div class="outline-text-2" id="text-2">


<p>
ALL THIS STUFF GOES IN YOU .emacs FILE 
</p>


<pre class="example">;;;;SLIME MODE SETTING INFERIROR LISP
(setq inferior-lisp-program "~/scripts/ccl")
(require 'slime-autoloads)
(setq slime-net-coding-system 'utf-8-unix)
(slime-setup '(slime-fancy))

(setq slime-lisp-implementations
      '((ccl ( "~/scripts/ccl"))
        (sbcl ("/opt/sbcl/bin/sbcl") :coding-system utf-8-unix)))

</pre>



</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Getting the options working in emacs </h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> M- - M-x slime (thats Alt minus sign then Alt-x slime) </h3>
<div class="outline-text-3" id="text-3.1">

<p>this command will enter the function above in your 
.emacs file. from there you will be asked which 
lisp you want to use
</p></div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2"><span class="section-number-3">3.2</span> ccl     ;; for 32 bit </h3>
<div class="outline-text-3" id="text-3.2">

</div>

</div>

<div id="outline-container-3.3" class="outline-3">
<h3 id="sec-3.3"><span class="section-number-3">3.3</span> ccl64   ;; for 64 bit </h3>
<div class="outline-text-3" id="text-3.3">


</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: N-CRITSER 
<a href="mailto:critser101@gmail.com">&lt;critser101@gmail.com&gt;</a>
</p>
<p class="date"> Date: <2014-02-26 Wed></p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
